tap "azure/functions"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "leoafarias/fvm"
tap "withgraphite/tap"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Library and utilities for processing GIFs
brew "giflib"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Develop and deploy code with zero configuration
brew "railway"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Graphical command-line client for SSH
brew "sshs"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# 3D CAD software
cask "shapr3d"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adlerribeiro.real-synth-2-0"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-theme-onedark"
vscode "akil-s.tokyo-dark"
vscode "alphaxek.github-actions-locally"
vscode "angular.ng-template"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "brittanychiang.halcyon-vscode"
vscode "daltonmenezes.aura-theme"
vscode "danielknights.vscode-mjml"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dominicvonk.parameter-hints"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ekelley.midnight-synth"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eternal.tokyo-night-horizon"
vscode "ghmcadams.lintlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphite.gti-vscode"
vscode "hancel.markdown-image"
vscode "hashicorp.terraform"
vscode "helgardrichard.helium-icon-theme"
vscode "huacnlee.theme-macos-classic"
vscode "irongeek.vscode-env"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jirkavrba.subway-surfers"
vscode "lczerniawski.obsidiansunset"
vscode "localizely.flutter-intl"
vscode "lokalise.i18n-ally"
vscode "louiswt.regexp-preview"
vscode "mcagampan.dark-horizon"
vscode "mindfull.theme-violet-midnight"
vscode "mineiros.terramate"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "orta.vscode-twoslash-queries"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "pshershov.blueberry-banana"
vscode "ranawaysuccessfully.odpmdo"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryuta46.multi-command"
vscode "shaneyu.beyond-the-horizon-theme-vscode"
vscode "sldobri.bunker"
vscode "softwaredotcom.swdc-vscode"
vscode "stylelint.vscode-stylelint"
vscode "sujan.code-blue"
vscode "sveggiani.vscode-field-lights"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tabnine.tabnine-vscode"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tonka3000.raycast"
vscode "uloco.theme-bluloco-dark"
vscode "usernamehw.errorlens"
vscode "victorfadias.victor-s-dark-horizon"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "yandeu.five-server"
vscode "yoavbls.pretty-ts-errors"
vscode "yummygum.city-lights-icon-vsc"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
